{"data":{"site":{"siteMetadata":{"title":"Joel's dev blog","author":"Joel Mun"}},"markdownRemark":{"id":"de64c6f4-2a08-5363-ba6b-af36a064cb9a","excerpt":"So I went to the Def Con at Command ROK Fleet in Busan, jointly held with the CNFK (Commander, US Naval Forces Korea) and won the first place.  Well seriously I…","html":"<p>So I went to the Def Con at Command ROK Fleet in Busan, jointly held with the CNFK (Commander, US Naval Forces Korea) and won the first place. </p>\n<p>Well seriously I’m not good AT ALL, but the people who came were worse…</p>\n<p>You know, if I go and test myself out in public whitehat contest, I would get dropped out in preliminaries. But this is inside the army.. so whatever. </p>\n<p>The game was set up on a virtual environment. </p>\n<p>Participants connected to virtual computers connected within the same subnet loaded upon AWS via <a href=\"https://mremoteng.org/\">mRemoteNG</a>.</p>\n<p>The whole game was set up by the company called <a href=\"https://en.wikipedia.org/wiki/Sentek_Global\">Sentek Global</a> that used <a href=\"https://www.haikurange.com/\">Haiku Cyber Range</a> to make a virtual hacking (or more precisely, ‘already hacked’) environment. The subnet included about 8 compromised end user devices, and they displayed certain symptoms. And we had to find those symptoms and the cause, and suggest countermeasures to be taken against them. That was how it was scored. </p>\n<p>Seriously, if any of you penultimate students studying Computer Science came to this contest, you would have won it. </p>\n<p>Anyways it was a good experience at least. I also met US POs and had a chance to talk with them.</p>","frontmatter":{"title":"Review on DEF CON@COMROKFLT 2018","date":"June 19, 2018","description":null}}},"pageContext":{"slug":"/2018-06-19--Review-on-DEF-CON@COMROKFLT-2018/","previous":{"fields":{"slug":"/2018-06-16--Creating-music-player-(3):-Digging-redux-+-react/"},"frontmatter":{"title":"Creating music player (3): Digging redux + react"}},"next":{"fields":{"slug":"/2018-06-23--Semicolon-in-javascript/"},"frontmatter":{"title":"Semicolon in javascript"}}}}