{"data":{"site":{"siteMetadata":{"title":"Joel's dev blog","author":"Joel Mun"}},"markdownRemark":{"id":"864dbacb-d4a3-5ee8-878b-d6e3748612a8","excerpt":"Sources Lifewire SSLStore Hash A hashing algorithm is a mathematical function that condenses data to a fixed size.  It is easier for the computer to first…","html":"<h3>Sources</h3>\n<ul>\n<li><a href=\"https://www.lifewire.com/what-is-md5-2625937\">Lifewire</a></li>\n<li><a href=\"https://www.thesslstore.com/blog/difference-sha-1-sha-2-sha-256-hash-algorithms/\">SSLStore</a></li>\n</ul>\n<h3>Hash</h3>\n<ul>\n<li>A hashing algorithm is a mathematical function that condenses data to a fixed size. </li>\n<li>It is easier for the computer to first compute a hash and then compare them than it would be to compare the original files.</li>\n<li>Two crucial characteristics on hashing algorithm are: <strong>irreversible and unique</strong>—Not being able to get the input by looking at the output(but don’t be relieved—it could still be cracked by just producing lots of outputs to get the same hash), and not being able to produce the same output with another input. </li>\n<li>Hash and <strong>Checksum</strong> are almost the same things. Just use the terms interchangeably until things get more familiar to you for now. </li>\n</ul>\n<h3>MD5</h3>\n<ul>\n<li>MD5 (technically called MD5 Message-Digest Algorithm) is a cryptographic hash function whose <strong>main purpose is to verify that a file has been unaltered.</strong></li>\n<li>MD5 has many security breaches that have been revealed, so it is useless for any security applications.</li>\n<li>It is however still useful for <strong>checking non-cryptographic checksum to verify data integrity and detect unintentional data corruption.</strong></li>\n<li>MD5 hashes are 128-bits in length and are normally shown in their 32 digit hexadecimal value equivalent.</li>\n</ul>\n<h3>SHA</h3>\n<p>Secure Hash Algorithm. It’s got different kinds:</p>\n<ul>\n<li>SHA-1</li>\n<li>SHA-2</li>\n<li>SHA-256</li>\n<li>SHA-…</li>\n</ul>\n<p>And here are things to know:</p>\n<ul>\n<li>SHA-1 is a 160-bit hash.</li>\n<li>SHA-2 is most popularly 256-bit but it has other versions as well. When you say SHA-2, you are referring to a ‘family’.</li>\n<li>SHA-1 is not safe anymore. From 2016 onward, SHA-2 is the new standard. If you are receiving a certificate today it must be using that signature at a minimum.</li>\n<li>The variety of SHA-2 hashes can lead to a bit of confusion, as websites and authors express them differently. If you see “SHA-2,” “SHA-256” or “SHA-256 bit,” those names are referring to the same thing. If you see “SHA-224,” “SHA-384,” or “SHA-512,” those are referring to the alternate bit-lengths of SHA-2. You may also see some sites being more explicit and writing out both the algorithm and bit-length, such as “SHA-2 384.”</li>\n<li>One future implication: computing powers maintain to grow, so SHA-2 will be likely to be insecure after about 2020. </li>\n</ul>","frontmatter":{"title":"MD5 and SHA","date":"May 12, 2018"}}},"pageContext":{"slug":"/2018-05-12--MD5-and-SHA/","previous":{"fields":{"slug":"/2018-05-12--Windows-Registry/"},"frontmatter":{"title":"Windows Registry"}},"next":{"fields":{"slug":"/2018-05-12--Three-way-handshake-in-TCP-&-ACK-and-SYN-flood-attack/"},"frontmatter":{"title":"Three-way handshake in TCP & ACK and SYN flood attack"}}}}