{"data":{"site":{"siteMetadata":{"title":"Joel's dev blog","author":"Joel Mun","siteUrl":"https://9oelm.github.io"}},"markdownRemark":{"id":"d665188c-1db4-5d67-bb7f-904e8d9165c7","excerpt":"So I nearly worked half a year (indeed!) on the project  Youtube Lite .\nHere’s a  related post on that if you wanna see. Things I learned Never start testing…","html":"<p>So I nearly worked half a year (indeed!) on the project <a href=\"https://youtube-lite.js.org\">Youtube Lite</a>.\nHere’s a <a href=\"https://9oelm.github.io/2018-09-18--Controlled-youtube-(2):-adding-tests/\">related post on that if you wanna see.</a></p>\n<h1>Things I learned</h1>\n<h2>Never start testing after you’ve coded</h2>\n<ul>\n<li>It makes it really hard to pass tests if you are not keeping up with making tests along with your project code. </li>\n<li>I did not know anything about testing, so I just went onto making functions first and then <em>at last</em> the tests. The problem was, errors arose from the tests. Then if I resolved one error, another would be up, and then another, then another, and so on. This was a really tiring process; I spent so much time on this, and then the tests started working. </li>\n<li>Even if the tests are working, if you haven’t started making tests from the beginning, there would be a LOT of tests to add. So this is actually quite daunting; It’s just better to start from the beginning.</li>\n<li>TDD. Make a function and have a proof against it with a test. It’s never bad to make tests. </li>\n</ul>\n<h2>For web projects, webpack would suffice</h2>\n<ul>\n<li>Out of curiosity at first, I used <code class=\"language-text\">gulp</code> instead of <code class=\"language-text\">webpack</code>. But it turned out that it’s not a really right choice. <code class=\"language-text\">gulp</code> is just for automation in general, but <code class=\"language-text\">webpack</code> is specifically for web projects, offering bundling and automation. </li>\n<li>Moreoever, <code class=\"language-text\">gulp</code> is undergoing a breaking change from 3.x to 4, so things are still a bit quirky if you want to use the most recent version. </li>\n</ul>\n<h2>create-react-app</h2>\n<ul>\n<li>Well, I don’t know. Facebook decided to not offer developers an ability to manage webpack configs in <code class=\"language-text\">create-react-app</code>. And it’s trying to offer it in the future (<a href=\"https://github.com/facebook/create-react-app/issues/6303\">see this issue</a>), but we’ve gotta wait. This is awful, because if you want some adjustments to your webpack config, you will either need to <code class=\"language-text\">eject</code> or use <a href=\"https://github.com/timarney/react-app-rewired\"><code class=\"language-text\">react-app-rewired</code></a>. Perhaps this was one of ther reasons I had to resort to <code class=\"language-text\">gulp</code>. </li>\n<li>in <code class=\"language-text\">create-react-app</code> v.1.x, you needed to separately compile <code class=\"language-text\">sass</code> in order for it to work. In v.2.x, although the patches came through to enable this, this left me a bad impression, because I am really a big fan of <code class=\"language-text\">sass</code>.</li>\n</ul>\n<h2>Refactor every time you code</h2>\n<ul>\n<li>It’s really hard to refactor code as you procrastinate on it, because the amount of codes increase dramatically. </li>\n<li>Have a habit to refactor code every time you commit/push/…</li>\n</ul>\n<h2>Setup, setup, setup</h2>\n<ul>\n<li>Project setup is really important. Choosing suitable tools will make your life happier. Get dependencies for linting, bundling, warning, testing, … anything that helps make your life easier. </li>\n<li>Also, keep updated with project dependencies. It may be a good idea to use something like <a href=\"https://dependabot.com/\">Dependabot</a>. If you have like 10+ dependencies to update and you update them once and tests break, you don’t know which one they break from. </li>\n<li>It gets really difficult for you to change dependencies after you have subsisted on them for a while. So your initial decision becomes important.</li>\n</ul>","frontmatter":{"title":"Youtube lite: looking back","date":"March 02, 2019"}}},"pageContext":{"slug":"/2019-03-02--Youtube-lite:-looking-back/","previous":{"fields":{"slug":"/2019-02-26--GOOP:-7.-GOOP-Now/"},"frontmatter":{"title":"GOOP: 7. GOOP now"}},"next":{"fields":{"slug":"/2019-03-09--100BooksProject-(1):Remember-Who-You-Are:-Life-Stories-That-Inspire-the-Heart-and-Mind/"},"frontmatter":{"title":"100 Books Project (1): Reflection and reading notes on Remember Who You Are: Life Stories That Inspire the Heart and Mind"}}}}