{"data":{"site":{"siteMetadata":{"title":"Joel's dev blog","author":"Joel Mun","siteUrl":"https://9oelm.github.io"}},"markdownRemark":{"id":"4ef20e92-2236-5de5-b9f4-48bee59a24c7","excerpt":"Note Below content is just a excerpt from the websites. If you need to see in detail, don’t hesitate to go onto  the original website . What is Tor Tor is an…","html":"<h2>Note</h2>\n<p>Below content is just a excerpt from the websites. If you need to see in detail, don’t hesitate to go onto <a href=\"https://www.torproject.org/about/overview.html.en\">the original website</a>.</p>\n<h2>What is Tor</h2>\n<p>Tor is an Internet networking protocol designed to anonymize the data relayed across it. <a href=\"https://www.tomsguide.com/us/what-is-tor-faq,news-17754.html\">(Tom’s guide)</a></p>\n<h2>How does Tor work</h2>\n<h3>The Tor network</h3>\n<p>The Tor network is a group of volunteer-operated servers that allows people to improve their privacy and security on the Internet. Tor’s users employ this network by connecting through <strong>a series of virtual tunnels rather than making a direct connection</strong>, thus allowing both organizations and individuals to share information over public networks without compromising their privacy. </p>\n<p>The variety of people who use Tor is actually part of what makes it so secure. <strong>Tor hides you among the other users on the network</strong>, so the more populous and diverse the user base for Tor is, the more your anonymity will be protected. </p>\n<p>Using Tor <strong>protects</strong> you against a common form of Internet surveillance known as <strong>“traffic analysis.”</strong> Traffic analysis can be used to infer who is talking to whom over a public network. Knowing the source and destination of your Internet traffic allows others to track your behavior and interests.</p>\n<h3>Why privacy is in danger without Tor</h3>\n<p>Internet data packets are comprised of (1) Data payload and (2) header used for routing. The data payload may be encrypted, but the header may not, because it needs to publicly state where the data has to go.</p>\n<p>Now, authorized/unauthorized intermediaries, such as ISPs, could sit there and watch over the headers. </p>\n<h3>What Tor does for your privacy</h3>\n<p>Instead of taking a direct route from source to destination, data packets on the Tor network take a random pathway through several relays that cover your tracks so no observer at any single point can tell where the data came from or where it’s going.</p>\n<p>Below is a picture from the Tor website to help understand.</p>\n<p><img src=\"https://www.torproject.org/images/htw2.png\" alt=\"Tor network explained\"></p>\n<p>To create a private network pathway with Tor, the user’s software or client incrementally builds a circuit of encrypted connections through relays on the network. The circuit is extended one hop at a time, and each relay along the way knows only which relay gave it data and which relay it is giving data to. No individual relay ever knows the complete path that a data packet has taken. The client negotiates a separate set of encryption keys for each hop along the circuit to ensure that each\nhop can’t trace these connections as they pass through. </p>\n<p>For efficiency, the Tor software uses the same circuit for connections that happen within the same ten minutes or so. Later requests are given a new circuit, to keep people from linking your earlier actions to the new ones. </p>\n<h3>Kind warning on Tor</h3>\n<p>Tor does not completely save you from the issue of privacy. It only focuses on <strong>protecting the transport of data</strong>. See the <a href=\"https://en.wikipedia.org/wiki/Tor_%28anonymity_network%29#Weaknesses\">weaknesses</a> section of Wikipedia page on Tor for more. </p>","frontmatter":{"title":"Using tor","date":"September 29, 2017"}}},"pageContext":{"slug":"/2017-09-29--Using-tor/","previous":{"fields":{"slug":"/2017-09-28--Using-vim/"},"frontmatter":{"title":"Using vim"}},"next":{"fields":{"slug":"/2017-10-01--Difference-among-const-let-and-var/"},"frontmatter":{"title":"Difference among const, let, var"}}}}