{"data":{"site":{"siteMetadata":{"title":"Joel's dev blog","author":"Joel Mun"}},"markdownRemark":{"id":"3f86c628-d188-5ffd-b3b6-bebf2c6f15c0","excerpt":"Hacking-notes Rationale As a programmer, I thought it’d be nice to know the basics of hacking for security purposes. For now, we will focus on popular hacking…","html":"<h1>Hacking-notes</h1>\n<h2>Rationale</h2>\n<p>As a programmer, I thought it’d be nice to know the basics of hacking for security purposes. For now, we will focus on popular hacking methods.</p>\n<h2>Reverse engineering</h2>\n<h3>What</h3>\n<p>As the name implies, it is the process of extracting knowledge or design information from a program and reproducing anything from the extracted information. Computers programs are executed in low-level languages which humans cannot easily understand. Even if a programmer uses high-level languages like Java, Python, etc, the codes for the program will be assembled in a machine-specific format.</p>\n<h3>Why</h3>\n<p>Hackers seek to find flaws in programs which they can exploit. Others could also use reversing to locate weak points to fortify their defence against potential attacks.</p>\n<h3>How</h3>\n<ul>\n<li>Use disassemblers to disect binary codes into assembly codes. They are also used to extract strings, functions, libraries. In short, they help change low-level language into higher level languages.</li>\n<li>Use debugers. Debuggers allow hackers to expand the functionality of disassemblers by supporting the CPU registers, hex dumping of programs, view of the stacks. They are also used to set breakpoints and edit assembly codes at runtime. </li>\n<li>Use hex editors to view and edit binaries.</li>\n<li>Use decompiler. </li>\n<li>Gain understanding of low(er)-level programming languages like c, php. </li>\n</ul>\n<h2>Trojan horse programming</h2>\n<h3>What</h3>\n<p>Trojan horses are malicious computer programs which misleads users of its true intent. Trojans are usually spread from social engineering-for example from a email attachment that seems credible. Sometimes trojans can be remotely controlled by hackers. </p>\n<h3>Why</h3>\n<p>Trojan horses are usually made to:</p>\n<ul>\n<li>capture screenshots of computer</li>\n<li>record key strokes and send files to hacker</li>\n<li>capture webcam videos/images</li>\n<li>give access to drives and files</li>\n<li>use the computer to further hack other things (called botnets-a network of Trojan horses. Used to control / steal data from other devices.).</li>\n</ul>\n<h3>How</h3>\n<ul>\n<li>\n<p>Trojan horses can be written in every programming language. For example, you could write them with C/C++ and Delphi. These are two popular choices, because of:</p>\n</li>\n<li>\n<p>Dependencies issue: malwares want to be run in many PCs as possible. C/C++/ASM do not require any other dependencies to be run. </p>\n</li>\n<li>\n<p>Small size: the malware needs to be as small as possible.</p>\n</li>\n<li>\n<p>Rootkits: it is a necessary requirement for Trojan horses. It prevents anti-viruses from removing them. </p>\n</li>\n<li>\n<p>A typical algorithm for a Trojan horse could be following (directly copied from <a href=\"https://www.gohacking.com/make-trojan-horse/\">https://www.gohacking.com/make-trojan-horse/</a>):</p>\n</li>\n<li>\n<p>Search for the root drive.</p>\n</li>\n<li>\n<p>Navigate to the following location on the root drive.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">%systemroot%\\Windows\\System32</code></pre></div>\n</li>\n<li>\n<p>Create the file named “spceshot.dll“.</p>\n</li>\n<li>\n<p>Start dumping the junk data onto the above file and keep increasing its size until the drive is full.</p>\n</li>\n<li>\n<p>Once the drive is full, stop the process.</p>\n</li>\n</ul>\n<h2>Social engineering</h2>\n<h3>What</h3>\n<p>Commonly, social engineering involves email or other communication that invokes urgency, fear, or similar emotions in the victim, leading the victim to promptly reveal sensitive information, click a malicious link, or open a malicious file (<a href=\"https://digitalguardian.com/blog/social-engineering-attacks-common-techniques-how-prevent-attack\">https://digitalguardian.com/blog/social-engineering-attacks-common-techniques-how-prevent-attack</a>). For example, you may receive a court notice to appear from an email. You click on the link because you are scared. You then get to install malwares.</p>\n<p>Social engineering can be divided into several kinds: </p>\n<ul>\n<li>Phishing: hackers obtain your personal information through links or any other paths.</li>\n<li>Pretexting: hackers create a context where you would feel some trusts, so that you may feel like sharing a bit of information about yourself. For example, you may send an email to a victim, disguising as his/her superior complimenting on him/her. Then you request some information on the email.</li>\n<li>Baiting: hackers promise an item or good that entices victims. For example, music downloads. This is not only limited to an online context-for example you could drop an USB that contains a malware in a parking lot of some company. The moment an employee inserts the USB into the computer, you could steal dozens of information through keylogger.</li>\n<li>Other forms of social engineering are basically alike.</li>\n</ul>\n<h3>Why</h3>\n<p>Here are some reasons why Hackers use social engineering to take advantage:</p>\n<ul>\n<li>Banking/Tax link scam: hackers send you an email with a phony link to your bank, alluring you to enter your bank ID and password. </li>\n<li>Dropbox link scam: hackers send you a link for something like resetting passwords, etc. Then you launch a Trojan by clikcing on the link.</li>\n</ul>\n<h3>How</h3>\n<p>Undone.</p>\n<h2>Symlink attack</h2>\n<h3>What</h3>\n<p>Symlink is a special type of file that refers to another file / directory in the form of an absolute or relative path. This affects pathname resolution. </p>\n<p>Symlink pointing to a target that is removed still exists and continues to be there. This is called a broken/dead/dangling symlink. Symlink could only be made in linux environment.</p>\n<h3>Why</h3>\n<ul>\n<li>Symlink could be altered to point to any other crucial files inside certain directory. For example, you could adjust a symlink to access and edit original databse. Alteration of symlinks could even mean hackers freely navigating through the file system.</li>\n</ul>\n<h3>How</h3>\n<p>Undone</p>\n<h2>Back door and remote administration</h2>\n<h3>What</h3>\n<p>A backdoor is a malware that gains remote access to resources inside an application, such as databases and file servers, by bypassing normal authentication or encryption in a computer system. ‘Leaving the back door open at home’ could allow an attacker to access your house without going through the main entrance where securty personnels check every single person entering the house.</p>\n<h3>How</h3>\n<p>Hackers use malware to install backdoors. This gives a remote administrative access to a system. Once an attacker has an access, he/she could do anything about the files. These are some kinds.</p>\n<h2>(Distributed) Denial of service (DDos)</h2>\n<h3>What</h3>\n<p>A distributed denial-of-service (DDoS) attack is an attack in which multiple compromised computer systems attack a target, such as a server, website or other network resource, and cause a denial of service for users of the targeted resource (<a href=\"http://searchsecurity.techtarget.com/definition/distributed-denial-of-service-attack\">http://searchsecurity.techtarget.com/definition/distributed-denial-of-service-attack</a>).</p>\n<p>Denial of service is usually done by flooding the targeted machine with excessive requests. </p>\n<p>DDoS attack in particular, can hardly be managed, because multiple sources at different IP addresses are used to flood the target machine. The administrator would have to block all IP addresses that do this, which is nearly impossible. </p>\n<p>General types of DDoS attack would be as follows:</p>\n<ul>\n<li>Traffic attacks: Traffic flooding attacks send a huge volume of TCP, UDP and ICPM packets to the target. Legitimate requests get lost and these attacks may be accompanied by malware exploitation.</li>\n<li>Bandwidth attacks: This DDos attack overloads the target with massive amounts of junk data. This results in a loss of network bandwidth and equipment resources and can lead to a complete denial of service.</li>\n<li>Application attacks: Application-layer data messages can deplete resources in the application layer, leaving the target’s system services unavailable.</li>\n</ul>\n<h3>How</h3>\n<ul>\n<li>Use LOIC/XOIC/HULK (HTTP Unbearable Load King)/DDOSIM – Layer 7 DDoS Simulator/R-U-Dead-Yet/Tor’s Hammer. Programs that make it easy for penetration tests.</li>\n<li>Compromise botnets: botnet is a set of ‘zombie’ computers. They are infected with malware and respond to the commands of the central computer. Use them to overload the victim server.</li>\n<li>Use some script to continuously request whatever information from the target server, thereby flooding it.</li>\n</ul>\n<h2>Cross-site scripting (XSS)</h2>\n<h3>What</h3>\n<p>Cross-Site Scripting (XSS) attacks are a type of injection, in which malicious scripts are injected into otherwise benign and trusted web sites. XSS attacks occur when an attacker uses a web application to send malicious code, generally in the form of a browser side script, to a different end user (<a href=\"https://www.owasp.org/index.php/Cross-site_Scripting_(XSS)\">https://www.owasp.org/index.php/Cross-site<em>Scripting</em>(XSS)</a>).</p>\n<p>XSS can take advantage o VBScript, ActiveX and Flash, but also Javascript-the most abused. </p>\n<h3>How</h3>\n<p>You need to find a way to inject malicious javascript codes into the web page that the victims will visit. </p>\n<p>Directly copied from <a href=\"https://www.acunetix.com/websitesecurity/cross-site-scripting/\">https://www.acunetix.com/websitesecurity/cross-site-scripting/</a>:</p>\n<p>The following server-side pseudo-code is used to display the most recent comment on a web page.</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">print &quot;&lt;html&gt;&quot;\nprint &quot;&lt;h1&gt;Most recent comment&lt;/h1&gt;&quot;\nprint database.latestComment\nprint &quot;&lt;/html&gt;&quot;</code></pre></div>\n<p>Then you decide to submit a comment that is:</p>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">&lt;html&gt;\n&lt;h1&gt;Most recent comment&lt;/h1&gt;\n&lt;script&gt;doSomethingEvil();&lt;/script&gt;\n&lt;/html&gt;</code></pre></div>\n<p>When the page loads in the victim’s browser, the attacker’s malicious script will execute, most often without the user realizing or being able to prevent such an attack.</p>\n<p>How worst could it be?</p>\n<ul>\n<li>Malicious JavaScript has access to all the same objects the rest of the web page has, including access to cookies. Cookies are often used to store session tokens, if an attacker can obtain a user’s session cookie, they can impersonate that user.</li>\n<li>JavaScript can read and make arbitrary modifications to the browser’s DOM (within the page that JavaScript is running).</li>\n<li>JavaScript can use XMLHttpRequest to send HTTP requests with arbitrary content to arbitrary destinations.</li>\n<li>JavaScript in modern browsers can leverage HTML5 APIs such as accessing a user’s geolocation, webcam, microphone and even the specific files from the user’s file system. While most of these APIs require user opt-in, XSS in conjunction with some clever social engineering can bring an attacker a long way.</li>\n</ul>\n<h2>DNS Cache poisoning (AKA DNS Cache spoofing)</h2>\n<h3>What (directly copied from <a href=\"https://www.howtogeek.com/161808/htg-explains-what-is-dns-cache-poisoning/\">https://www.howtogeek.com/161808/htg-explains-what-is-dns-cache-poisoning/</a>).</h3>\n<p>DNS cache poisoning, also known as DNS spoofing, is a type of attack that exploits vulnerabilities in the domain name system (DNS) to divert Internet traffic away from legitimate servers and towards fake ones </p>\n<h3>How (directly copied from <a href=\"https://www.howtogeek.com/161808/htg-explains-what-is-dns-cache-poisoning/\">https://www.howtogeek.com/161808/htg-explains-what-is-dns-cache-poisoning/</a>).)</h3>\n<p>How does DNS work? Whenever your computer contacts a domain name like “google.com,” it must first contact its DNS server. The DNS server responds with one or more IP addresses where your computer can reach google.com. Your computer then connects directly to that numerical IP address. DNS converts human-readable addresses like “google.com” to computer-readable IP addresses like “173.194.67.102”</p>\n<p>Your Internet service provider runs its own DNS servers, which cache information from other DNS servers. Your home router functions as a DNS server, which caches information from your ISP’s DNS servers. Your computer has a local DNS cache, so it can quickly refer to DNS lookups it’s already performed rather than performing a DNS lookup over and over again.</p>\n<p>A DNS cache can become poisoned if it contains an incorrect entry. For example, if an attacker gets control of a DNS server and changes some of the information on it — for example, they could say that google.com actually points to an IP address the attacker owns — that DNS server would tell its users to look for Google.com at the wrong address. The attacker’s address could contain some sort of malicious phishing website.</p>\n<h2>Clickjacking attacks</h2>\n<h3>What</h3>\n<p>Clickjacking (User Interface redress attack, UI redress attack, UI redressing) is a malicious technique of tricking a Web user into clicking on something different from what the user perceives they are clicking on, thus potentially revealing confidential information or taking control of their computer while clicking on seemingly innocuous web pages (directly copied from <a href=\"https://en.wikipedia.org/wiki/Clickjacking\">https://en.wikipedia.org/wiki/Clickjacking</a>).</p>\n<p>One of the most notorious examples of Clickjacking was an attack against the Adobe Flash plugin settings page. By loading this page into an invisible iframe, an attacker could trick a user into altering the security settings of Flash, giving permission for any Flash animation to utilize the computer’s microphone and camera.</p>\n<h3>How</h3>\n<p>Just make something invisible and malicious that the user can click on.</p>\n<h2>Packet sniffing</h2>\n<h3>What</h3>\n<p>Packet sniffing is the act of capturing packets of data flowing across a computer network. You could censor almost all protocols:</p>\n<ul>\n<li>Total traffic</li>\n<li>Web traffic (HTTP, HTTPS)</li>\n<li>Mail traffic (IMAP, POP3, SMTP)</li>\n<li>File transfer traffic (FTP, P2P)</li>\n<li>Infrastructure traffic (DHCP, DNS, ICMP, SNMP)</li>\n<li>Remote control (RDP, SSH, VNC)</li>\n<li>Other UDP and TCP traffic</li>\n</ul>\n<h3>How (<a href=\"https://www.lifewire.com/introduction-to-packet-sniffing-2486803\">https://www.lifewire.com/introduction-to-packet-sniffing-2486803</a>)</h3>\n<p>By placing a packet sniffer on a network in promiscuous mode, a malicious intruder can capture and analyze all of the network traffic. Within a given network, username and password information is generally transmitted in clear text which means that the information would be viewable by analyzing the packets being transmitted.</p>\n<p>A packet sniffer can only capture packet information within a given subnet. So, its not possible for a malicious attacker to place a packet sniffer on their home ISP network and capture network traffic from inside your corporate network (although there are ways that exist to more or less “hijack” services running on your internal network to effectively perform packet sniffing from a remote location).</p>\n<p>Wireshark is one of the most prevalent software to use.</p>\n<h2>Injection attacks (Web-based attacks)</h2>\n<h3>What</h3>\n<p>Injection attacks refer to a broad class of attack vectors that allow an attacker to supply untrusted input to a program, which gets processed by an interpreter as part of a command or query which alters the course of execution of that program. </p>\n<p>Do you get it?-actually, XSS is a type of injection attacks.</p>\n<p>As for SQL injection, a hacker injects SQL commands that can read or modify data from a database. Advanced variations of this attack can be used to write arbitrary files to the server and even execute OS commands which may lead to full system compromise.</p>\n<h3>How</h3>\n<p>Injection attacking happens because of the flaws in SQL database, SQL libraries, or OS. Users open files that contain hidden commands - called injections. These commands will allow hackers to get unauthorized access to critical data.</p>\n<p>SQL injection is a particularly widespread and dangerous form of injection. To exploit a SQL injection flaw, the attacker must find a parameter that the web application passes through to a database. By carefully embedding malicious SQL commands into the content of the parameter, the attacker can trick the web application into forwarding a malicious query to the database (<a href=\"https://www.owasp.org/index.php/Injection_Flaws\">https://www.owasp.org/index.php/Injection_Flaws</a>). </p>\n<h2>Broken authentication and session management attacks</h2>\n<h3>What</h3>\n<p>Poorly protected session IDs-for example, a session ID included on the URL-would allow others to get into that session without any authroization. </p>\n<h3>How</h3>\n<p>Hackers can take over the control of your website if the authentication system of the website is weak. Authentication systems include passwords, key mangement, session IDs and cookies, which are all relevant to hackers doing ‘works’.</p>\n<p>UPenn[link]:<a href=\"http://www.upenn.edu/computing/security/swat/SWAT_Top_Ten_A3.php\">http://www.upenn.edu/computing/security/swat/SWAT<em>Top</em>Ten_A3.php</a>]</p>\n<h2>Notable recent hacking crisis</h2>\n<h2>sources</h2>\n<ul>\n<li><a href=\"https://www.helpnetsecurity.com/2016/02/12/know-your-enemy-the-most-popular-hacking-methods/\">https://www.helpnetsecurity.com/2016/02/12/know-your-enemy-the-most-popular-hacking-methods/</a></li>\n<li><a href=\"https://fossbytes.com/hacking-techniques/\">https://fossbytes.com/hacking-techniques/</a></li>\n<li><a href=\"https://www.slideshare.net/H4C/ss-59722847\">https://www.slideshare.net/H4C/ss-59722847</a></li>\n<li><a href=\"http://armor2net.com/knowledge/hackers_methods.htm\">http://armor2net.com/knowledge/hackers_methods.htm</a></li>\n<li><a href=\"http://defencely.com/blog/10-popular-ways-hackers-hack-website/\">http://defencely.com/blog/10-popular-ways-hackers-hack-website/</a></li>\n<li><a href=\"http://www.informationsecuritybuzz.com/study-research/top-10-hacking-methods/\">http://www.informationsecuritybuzz.com/study-research/top-10-hacking-methods/</a></li>\n</ul>\n<p>Reverse engineering</p>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Reverse_engineering\">https://en.wikipedia.org/wiki/Reverse_engineering</a></li>\n<li><a href=\"https://www.techopedia.com/definition/3868/reverse-engineering\">https://www.techopedia.com/definition/3868/reverse-engineering</a></li>\n<li><a href=\"http://resources.infosecinstitute.com/hacking-tools-reverse-engineering/#gref\">http://resources.infosecinstitute.com/hacking-tools-reverse-engineering/#gref</a></li>\n</ul>\n<p>Trojan horse programming</p>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Trojan_horse_(computing\">https://en.wikipedia.org/wiki/Trojan<em>horse</em>(computing</a>)</li>\n<li><a href=\"http://makhaai.blogspot.kr/2008/05/trojan-programming-for-beginners.html\">http://makhaai.blogspot.kr/2008/05/trojan-programming-for-beginners.html</a></li>\n<li><a href=\"http://www.mightyshouts.com/trojan-horse/\">http://www.mightyshouts.com/trojan-horse/</a></li>\n<li><a href=\"http://etutorials.org/Misc/computer+book/Part+2+Dangerous+Threats+on+the+Internet/Chapter+8+Trojan+Horses-+Beware+of+Geeks+Bearing+Gifts/HOW+HACKERS+WRITE+A+TROJAN+HORSE/\">http://etutorials.org/Misc/computer+book/Part+2+Dangerous+Threats+on+the+Internet/Chapter+8+Trojan+Horses-+Beware+of+Geeks+Bearing+Gifts/HOW+HACKERS+WRITE+A+TROJAN+HORSE/</a></li>\n</ul>\n<p>Social engineering</p>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Social_engineering_(security\">https://en.wikipedia.org/wiki/Social<em>engineering</em>(security</a>)</li>\n<li><a href=\"https://digitalguardian.com/blog/social-engineering-attacks-common-techniques-how-prevent-attack\">https://digitalguardian.com/blog/social-engineering-attacks-common-techniques-how-prevent-attack</a></li>\n<li><a href=\"https://www.tripwire.com/state-of-security/security-awareness/5-social-engineering-attacks-to-watch-out-for/\">https://www.tripwire.com/state-of-security/security-awareness/5-social-engineering-attacks-to-watch-out-for/</a></li>\n<li><a href=\"https://null-byte.wonderhowto.com/how-to/hack-like-pro-spear-phish-with-social-engineering-toolkit-set-backtrack-0148571/\">https://null-byte.wonderhowto.com/how-to/hack-like-pro-spear-phish-with-social-engineering-toolkit-set-backtrack-0148571/</a></li>\n</ul>\n<p>Symlink attack</p>\n<ul>\n<li><a href=\"http://groups.hcon.in/uploads/1/8/1/9/1819392/hga_bhashit_pandya_-_symlink_attack.pdf\">http://groups.hcon.in/uploads/1/8/1/9/1819392/hga<em>bhashit</em>pandya<em>-</em>symlink_attack.pdf</a></li>\n<li><a href=\"http://endlessgeek.com/2014/03/linux-one-liner-to-detect-symlink-attack/\">http://endlessgeek.com/2014/03/linux-one-liner-to-detect-symlink-attack/</a></li>\n<li><a href=\"https://www.samba.org/samba/news/symlink_attack.html\">https://www.samba.org/samba/news/symlink_attack.html</a></li>\n<li><a href=\"https://blog.sucuri.net/2013/05/from-a-site-compromise-to-full-root-access-symlinks-to-root-part-i.html\">https://blog.sucuri.net/2013/05/from-a-site-compromise-to-full-root-access-symlinks-to-root-part-i.html</a></li>\n</ul>\n<p>Backdoor attack</p>\n<ul>\n<li><a href=\"http://blog.trendmicro.com/backdoor-attacks-work-protect/\">http://blog.trendmicro.com/backdoor-attacks-work-protect/</a></li>\n<li><a href=\"https://www.incapsula.com/web-application-security/backdoor-shell-attack.html\">https://www.incapsula.com/web-application-security/backdoor-shell-attack.html</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/Backdoor_(computing\">https://en.wikipedia.org/wiki/Backdoor_(computing</a>)</li>\n<li><a href=\"https://securingtomorrow.mcafee.com/consumer/identity-protection/backdoor-threat/\">https://securingtomorrow.mcafee.com/consumer/identity-protection/backdoor-threat/</a></li>\n</ul>\n<p>DDoS Attack</p>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Denial-of-service_attack\">https://en.wikipedia.org/wiki/Denial-of-service_attack</a></li>\n<li><a href=\"http://searchsecurity.techtarget.com/definition/distributed-denial-of-service-attack\">http://searchsecurity.techtarget.com/definition/distributed-denial-of-service-attack</a></li>\n<li><a href=\"http://www.webopedia.com/TERM/D/DDoS_attack.html\">http://www.webopedia.com/TERM/D/DDoS_attack.html</a></li>\n<li><a href=\"https://heimdalsecurity.com/blog/how-to-ddos/\">https://heimdalsecurity.com/blog/how-to-ddos/</a></li>\n</ul>\n<p>Cross Site Scripting</p>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Cross-site_scripting\">https://en.wikipedia.org/wiki/Cross-site_scripting</a></li>\n<li><a href=\"https://www.owasp.org/index.php/Cross-site_Scripting_(XSS\">https://www.owasp.org/index.php/Cross-site<em>Scripting</em>(XSS</a>)</li>\n<li><a href=\"https://www.acunetix.com/websitesecurity/cross-site-scripting/\">https://www.acunetix.com/websitesecurity/cross-site-scripting/</a></li>\n<li><a href=\"https://www.netsparker.com/blog/web-security/cross-site-scripting-xss/\">https://www.netsparker.com/blog/web-security/cross-site-scripting-xss/</a></li>\n<li><a href=\"https://www.veracode.com/security/xss\">https://www.veracode.com/security/xss</a></li>\n</ul>\n<p>DNS Cache poisoning</p>\n<ul>\n<li><a href=\"https://www.howtogeek.com/161808/htg-explains-what-is-dns-cache-poisoning/\">https://www.howtogeek.com/161808/htg-explains-what-is-dns-cache-poisoning/</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/DNS_spoofing\">https://en.wikipedia.org/wiki/DNS_spoofing</a></li>\n<li><a href=\"https://www.veracode.com/security/cache-poisoning\">https://www.veracode.com/security/cache-poisoning</a></li>\n</ul>\n<p>Clickjacking attack</p>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/Clickjacking\">https://en.wikipedia.org/wiki/Clickjacking</a></li>\n<li><a href=\"https://www.owasp.org/index.php/Clickjacking\">https://www.owasp.org/index.php/Clickjacking</a></li>\n<li><a href=\"https://www.owasp.org/index.php/Clickjacking_Defense_Cheat_Sheet\">https://www.owasp.org/index.php/Clickjacking<em>Defense</em>Cheat_Sheet</a></li>\n</ul>\n<p>Packet sniffing attack</p>\n<ul>\n<li><a href=\"https://www.lifewire.com/introduction-to-packet-sniffing-2486803\">https://www.lifewire.com/introduction-to-packet-sniffing-2486803</a></li>\n<li><a href=\"https://www.paessler.com/packet_sniffing\">https://www.paessler.com/packet_sniffing</a></li>\n<li><a href=\"http://www.colasoft.com/resources/packet_sniffing.php\">http://www.colasoft.com/resources/packet_sniffing.php</a></li>\n<li><a href=\"http://www.dummies.com/programming/networking/cisco/common-network-attack-strategies-packet-sniffing/\">http://www.dummies.com/programming/networking/cisco/common-network-attack-strategies-packet-sniffing/</a></li>\n</ul>\n<p>Injection attack</p>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/SQL_injection\">https://en.wikipedia.org/wiki/SQL_injection</a></li>\n<li><a href=\"https://www.acunetix.com/blog/articles/injection-attacks/\">https://www.acunetix.com/blog/articles/injection-attacks/</a></li>\n<li><a href=\"http://phpsecurity.readthedocs.io/en/latest/Injection-Attacks.html\">http://phpsecurity.readthedocs.io/en/latest/Injection-Attacks.html</a></li>\n<li><a href=\"https://www.ibm.com/support/knowledgecenter/en/SSB2MG_4.6.0/com.ibm.ips.doc/concepts/wap_injection_attacks.htm\">https://www.ibm.com/support/knowledgecenter/en/SSB2MG<em>4.6.0/com.ibm.ips.doc/concepts/wap</em>injection_attacks.htm</a></li>\n<li><a href=\"https://www.owasp.org/index.php/Injection_Flaws\">https://www.owasp.org/index.php/Injection_Flaws</a></li>\n<li><a href=\"https://www.owasp.org/index.php/Code_Injection\">https://www.owasp.org/index.php/Code_Injection</a></li>\n<li><a href=\"http://searchitchannel.techtarget.com/tip/Common-injection-attacks\">http://searchitchannel.techtarget.com/tip/Common-injection-attacks</a></li>\n</ul>\n<p>Broken authentication and session management attacks</p>\n<ul>\n<li><a href=\"https://www.owasp.org/index.php/Top_10_2017-A2-Broken_Authentication_and_Session_Management\">https://www.owasp.org/index.php/Top<em>10</em>2017-A2-Broken<em>Authentication</em>and<em>Session</em>Management</a></li>\n<li><a href=\"http://www.upenn.edu/computing/security/swat/SWAT_Top_Ten_A3.php\">http://www.upenn.edu/computing/security/swat/SWAT<em>Top</em>Ten_A3.php</a></li>\n<li><a href=\"https://www.owasp.org/index.php/Broken_Authentication_and_Session_Management\">https://www.owasp.org/index.php/Broken<em>Authentication</em>and<em>Session</em>Management</a></li>\n<li><a href=\"https://blog.detectify.com/2016/05/06/owasp-top-10-broken-authentication-and-session-management/\">https://blog.detectify.com/2016/05/06/owasp-top-10-broken-authentication-and-session-management/</a></li>\n</ul>\n<h2>Network related hacking methods</h2>\n<h3>DoS Attack</h3>\n<h4><a href=\"https://en.wikipedia.org/wiki/Smurf_attack\">1. Smurf attack</a></h4>\n<p>As we know, broadcast packets are not dropped by individual computers on a network. They require CPUs to work. </p>\n<blockquote>\n<p>The Smurf attack is a distributed denial-of-service attack in which large numbers of Internet Control Message Protocol (ICMP) packets with the intended victim’s spoofed source IP are broadcast to a computer network using an IP broadcast address. </p>\n</blockquote>\n<blockquote>\n<p>Most devices on a network will, by default, respond to this by sending a reply to the source IP address. If the number of machines on the network that receive and respond to these packets is very large, the victim’s computer will be flooded with traffic. This can slow down the victim’s computer to the point where it becomes impossible to work on.</p>\n</blockquote>\n<p>However, this method is manageable by network administrators. Thus smurf attack is left obsolete these days. The way admins could prevent this attack is as follows: </p>\n<ul>\n<li>\n<blockquote>\n<p>Configure individual hosts and routers to not respond to ICMP requests or broadcasts;</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>or Configure routers to not forward packets directed to broadcast addresses. Until 1999, standards required routers to forward such packets by default. Since then, the default standard was changed to not forward such packets.</p>\n</blockquote>\n</li>\n<li>\n<blockquote>\n<p>Another proposed solution is network ingress filtering, which rejects the attacking packets on the basis of the forged source address.</p>\n</blockquote>\n</li>\n</ul>\n<h4><a href=\"https://www.incapsula.com/ddos/attack-glossary/ping-icmp-flood.html\">2. Ping flood (ICMP Flood)</a></h4>\n<p>Brief note on ICMP Packets:</p>\n<blockquote>\n<p><a href=\"http://searchnetworking.techtarget.com/definition/ICMP\">Internet Control Message Protocol (ICMP) is used to debug network. It is a supporting protocol in the Internet protocol suite.</a> </p>\n</blockquote>\n<blockquote>\n<p><a href=\"https://en.wikipedia.org/wiki/Internet_Control_Message_Protocol\">It is used by network devices, including routers, to send error messages and operational information indicating, for example, that a requested service is not available or that a host or router could not be reached.</a></p>\n</blockquote>\n<p>Ping requests are usually used to see if two different devices are connected with each other. </p>\n<p>This is done by measuring the round-trip time from when an ICMP echo request is sent to when an ICMP echo reply is received. </p>\n<blockquote>\n<p>The attack involves flooding the victim’s network with request packets, knowing that the network will respond with an equal number of reply packets. Additional methods for bringing down a target with ICMP requests include the use of custom tools or code, such as hping and scapy.</p>\n</blockquote>\n<blockquote>\n<p>This strains both the incoming and outgoing channels of the network, consuming significant bandwidth and resulting in a denial of service.</p>\n</blockquote>","frontmatter":{"title":"hacking notes (1)","date":"November 02, 2018","description":null}}},"pageContext":{"slug":"/2018-11-02--hacking-notes-(1)/","previous":{"fields":{"slug":"/2018-10-24--How-to-typescript-+-Vue/"},"frontmatter":{"title":"How to typescript + Vue"}},"next":{"fields":{"slug":"/2018-12-29--Environment-setup-on-cloud/"},"frontmatter":{"title":"Envirnoment setup on cloud"}}}}