{"data":{"site":{"siteMetadata":{"title":"Joel's dev blog","author":"Joel Mun","siteUrl":"https://9oelm.github.io"}},"markdownRemark":{"id":"a1065820-25f8-5a66-ad0a-e72bcb85fac7","excerpt":"Sources microsoft MSDN microsoft MSDN 2 comodo.com What is it “A central hierarchical database used in Microsoft Windows 98, Windows CE, Windows NT, and Windows…","html":"<h3>Sources</h3>\n<ul>\n<li><a href=\"https://support.microsoft.com/en-us/help/256986/windows-registry-information-for-advanced-users\">microsoft MSDN</a></li>\n<li><a href=\"https://msdn.microsoft.com/en-us/library/windows/desktop/ms724182(v=vs.85).aspx\">microsoft MSDN 2</a></li>\n<li><a href=\"https://help.comodo.com/topic-159-1-290-3248-.html\">comodo.com</a></li>\n</ul>\n<h3>What is it</h3>\n<blockquote>\n<p>“A central hierarchical database used in Microsoft Windows 98, Windows CE, Windows NT, and Windows 2000 <strong>used to store information that is necessary to configure the system</strong> for one or more users, applications and hardware devices.” </p>\n</blockquote>\n<blockquote>\n<p>The Registry contains information that Windows <strong>continually references during operation</strong>, such as profiles for each user, the applications installed on the computer and the types of documents that each can create, property sheet settings for folders and application icons, what hardware exists on the system, and the ports that are being used. </p>\n</blockquote>\n<h3>Predefined registry keys (copied directly from microsoft)</h3>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">HKEY_CURRENT_USER\tContains the root of the configuration information for the user who is currently logged on. The user&#39;s folders, screen colors, and Control Panel settings are stored here. This information is associated with the user&#39;s profile. This key is sometimes abbreviated as &quot;HKCU.&quot;\n\nHKEY_USERS\tContains all the actively loaded user profiles on the computer. \n\nHKEY_CURRENT_USER is a subkey of HKEY_USERS. HKEY_USERS is sometimes abbreviated as &quot;HKU.&quot;\n\nHKEY_LOCAL_MACHINE\tContains configuration information particular to the computer (for any user). This key is sometimes abbreviated as &quot;HKLM.&quot;\n\nHKEY_CLASSES_ROOT\t\nIs a subkey of HKEY_LOCAL_MACHINE\\Software. The information that is stored here makes sure that the correct program opens when you open a file by using Windows Explorer. This key is sometimes abbreviated as &quot;HKCR.&quot; Starting with Windows 2000, this information is stored under both the HKEY_LOCAL_MACHINE and HKEY_CURRENT_USER keys. The HKEY_LOCAL_MACHINE\\Software\\Classes key contains default settings that can apply to all users on the local computer. The HKEY_CURRENT_USER\\Software\\Classes key contains settings that override the default settings and apply only to the interactive user. The HKEY_CLASSES_ROOT key provides a view of the registry that merges the information from these two sources. HKEY_CLASSES_ROOT also provides this merged view for programs that are designed for earlier versions of Windows. To change the settings for the interactive user, changes must be made under HKEY_CURRENT_USER\\Software\\Classes instead of under HKEY_CLASSES_ROOT. To change the default settings, changes must be made under HKEY_LOCAL_MACHINE\\Software\\Classes. If you write keys to a key under HKEY_CLASSES_ROOT, the system stores the information under HKEY_LOCAL_MACHINE\\Software\\Classes. If you write values to a key under HKEY_CLASSES_ROOT, and the key already exists under HKEY_CURRENT_USER\\Software\\Classes, the system will store the information there instead of under HKEY_LOCAL_MACHINE\\Software\\Classes.\n\nHKEY_CURRENT_CONFIG\tContains information about the hardware profile that is used by the local computer at system startup.</code></pre></div>\n<h3>Jargons and registry structure</h3>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">HKEY_LOCAL_MACHINE  --&gt; Called &#39;Hive&#39;\n|\n--HARDWARE --&gt; Called &#39;Key&#39;\n|\n--SAM\n|\n--SECURITY\n|\n--SOFTWARE\n    |\n    --...\n    |\n    --Google --&gt; Called &#39;Subkey&#39;\n    |\n    --Other apps</code></pre></div>","frontmatter":{"title":"Windows Registry","date":"May 12, 2018"}}},"pageContext":{"slug":"/2018-05-12--Windows-Registry/","previous":{"fields":{"slug":"/2018-05-11--Base64,-Unicode,-ASCII,-URL/"},"frontmatter":{"title":"Base64, Unicode, ASCII, URL"}},"next":{"fields":{"slug":"/2018-05-12--Three-way-handshake-in-TCP-&-ACK-and-SYN-flood-attack/"},"frontmatter":{"title":"Three-way handshake in TCP & ACK and SYN flood attack"}}}}