{"data":{"site":{"siteMetadata":{"title":null,"author":null}},"markdownRemark":{"id":"f682cdf7-038b-59a8-bb2a-981d6034300c","excerpt":"GOOP does not have a logo yet. I have to make one.  Before doing anything else, I have to know about Jeff’s business clearly. Otherwise, I cannot create a logo…","html":"<p>GOOP does not have a logo yet. I have to make one. </p>\n<p><strong>Before doing anything else, I have to know about Jeff’s business clearly. Otherwise, I cannot create a logo that is most suitable for the public and for Jeff’s (my) team.</strong></p>\n<p>Ok. so this is the overview of Jeff’s business. I tried to just digest the content from what Jeff has provided me and what we talked about for the meeting and produce it here. Copying directly from what Jeff provided me (i.e. evernote and other presentation materials) wouldn’t mean anything.</p>\n<ul>\n<li><strong>Brand name:</strong> GOOP (Good for groups)</li>\n<li><strong>Basic idea:</strong> The business provides technology based solution for any groups of people who would need to make decisions after discussion and expression of opinions. This could be basically applied to any mainstream chatting platforms (Facebook Messenger, Whatsapp, or whatever … yeah. so in this context, it would be better if these apps offer a place for third-party plug-in modules which would make it an easy job.). For now, FB messenger would be the most suitable platform for us to just settle down first. But we will see. </li>\n<li><strong>What’s the thing on opinion expression and decision making?:</strong> So basically, when you are in a group, and try to discuss something to agree on as a group (perhaps most times, remotely, but it doesn’t necessarily have to be like that), you face problems. It just gets messy. no system. many opinions. don’t know what to choose. you need to search for the best option possible and so on. and GOOP will resolve this problem.</li>\n<li><strong>What?? technology solution?:</strong> Open up GOOP and choose options, and it will take care of the rest of the process through an intelligent algorithm. “GOOP’s algorithm ranks suggestions by the principle of Maximimum Preferences Combinations.”</li>\n<li><strong>Features:</strong> simple inputs (easy UX with intuitive search—tab. tab. tab. no manual search), various modules (schedule, food, movie … and so on). </li>\n<li><strong>Target market:</strong> Basically anywhere where you need to make a decision and anybody who have to make a decision. Intuitively university students would need lots of group decision making and restaurants (food) and theatres (movies) would be the usual, popular places they need to make a decision on.</li>\n<li>\n<p><strong>Main business items:</strong></p>\n<ol>\n<li>GOOP Food. You are with a bunch of friends and want to find out what to do (especially in this item, what to eat). This fits well down along with what GOOP is able to provide. </li>\n<li>GOOP Event. This is for event organizers. By using GOOP and as long as message recipients agree on getting a message from event organizers, they (event organizers) can send out messages to audiences (event comers) and exhibitors. Organizers just need a “dedicated portal in making announcements/reminders to all exhibitor teams with just a click” and exhibitor teams get “customized and unique information that is related to their participation in the event”. Event organisers also would want to update on those who are interested in their events. So send away a message instantly to Facebook message subscribers(?) and “every audience receives tailor-made updates/reminders on event items they are interested in”</li>\n</ol>\n</li>\n</ul>","frontmatter":{"title":"GOOP: 1. Get to know the business","date":"April 08, 2018"}}},"pageContext":{"slug":"/2018-04-08--GOOP:-1.-Get-to-know-the-business/","previous":{"fields":{"slug":"/2018-04-08--GOOP:-4.-Finding-the-color-palette-and-font/"},"frontmatter":{"title":"GOOP: 4. Finding the color palette and font"}},"next":{"fields":{"slug":"/2018-04-09--This-&-Object-prototypes-(1):-this-or-That/"},"frontmatter":{"title":"This & Object prototypes (1): this or That?"}}}}