{"data":{"site":{"siteMetadata":{"title":"Joel's dev blog","author":"Joel Mun","siteUrl":"https://9oelm.github.io"}},"markdownRemark":{"id":"42230d00-3af4-5501-98e7-0d08822c257f","excerpt":"Reflections Again, another big encouragement from a book.  Things I got to know: Success is not everything. Things after success are substantially more…","html":"<h1>Reflections</h1>\n<p>Again, another big encouragement from a book. </p>\n<p>Things I got to know:</p>\n<ul>\n<li>Success is not everything. Things after success are substantially more important. </li>\n<li>You need to be a good person. That’s the first thing you need for everything. </li>\n<li>It’s all about people after all. People help you. I help them. That’s all. </li>\n<li>You need to be risk-taker who moves independently based on right judgments</li>\n</ul>\n<p>Yeap. Got greatly motivated by these, especially as a developer. I need to look further and wider. I need to dream bigger. I need to study more. </p>\n<h1>Reading notes</h1>\n<h2>1. A fall before rising: relax - enjoy and celebrate your life</h2>\n<ul>\n<li>A fall allows you to see the things you could not see when you were up there.</li>\n<li>With your success comes responsibility and duty.</li>\n</ul>\n<h2>2. The stuffed Bird: ignore thge distractions, have confidence, and focus on the task at hand.</h2>\n<ul>\n<li>Just like businesses, a life needs confidence and belief for an original action and achievement.</li>\n</ul>\n<h2>3. Be like yourself: draw a nuanced distinction between who you are and what you do</h2>\n<ul>\n<li>Be a man who is ‘like’ yourself at work.</li>\n<li>Develop an occupational persona that is ‘like’ you.</li>\n<li>Maintain a state where the two identities collaborate and interact.</li>\n</ul>\n<h2>4. A matter of black and white: examine your own past, where your ideas come from</h2>\n<ul>\n<li>You are a byproduct of your environment, times, parents, prejudices. You need to go back to check how these have led to my current understanding and thoughts.</li>\n</ul>\n<h2>5. A bad meal, and the truth: stay grounded and accessible</h2>\n<ul>\n<li>Acquiring a high position does not mean a change in the person itself.</li>\n<li>Make a human contact with all people working for you. Business is about bonding. It’s about interacting with staffs without any hurdles.</li>\n</ul>\n<h2>6. Reunion: reframe thge way you think about risk</h2>\n<ul>\n<li>Do not ever make decisions(university, job…) conscious of others.</li>\n<li>Be clear on what kind of compensation you want to get from your occupation</li>\n<li>Be prepared to comprehensively embrace the outcome of your choice.</li>\n<li>If your goal is narrow, you are more likely to fall into traps</li>\n<li>If you are going into an unfamiliar field, have yourself know about its long-term prospect</li>\n</ul>\n<h2>7. On the fallcy of perfection: let a new image of yourself emerge</h2>\n<ul>\n<li>Nobody has no weaknesses. It’s just that everybody wants to show their strengths only in a society where only strengths are pursued.</li>\n<li>For a reasonable judgment, you need every single piece of information (including the ones you don’t want to remember)</li>\n</ul>\n<h2>8. Katharine Hepburn and me: find a powerful leadership voice</h2>\n<ul>\n<li>If you have to give a speech, take the lead of audience with one or two sentences</li>\n<li>Only few minutes are given in an actual world for you to have the audience give a full attention to you</li>\n</ul>\n<h2>9. Sara’s story: realize that no one is a number</h2>\n<ul>\n<li>Numerous people helped you while you have been living in this world, giving up their own pride, goals, passion, dreams, and themselves.</li>\n<li>You need to pay back for their sacrifices with respect and regard for the people you get to meet.</li>\n</ul>\n<h2>10. In the moment: give the gift of high expectations</h2>\n<ul>\n<li>This moment never comes back. Every moment is a chance. Laziness is the enemy of the chance.</li>\n<li>Value every opportunity. Furthermore, find out the critical point where you can exert the most of your power.</li>\n</ul>\n<h2>11. WHy people will work for you: sacrifice some measure of your own power</h2>\n<ul>\n<li>As a superior, think of your staffs’ occupational development as the first priority. </li>\n<li>Allow them to work for something that’s got a prospect.</li>\n<li>Do not stop them from working on what they are crazy about and from what they get their energy from. Do not be scared to make them in charge of their work. </li>\n<li>Have a human relationship with your staffs to truly understand them.</li>\n<li>Would Karl Marx’s assertion on capitalism really be right? No. </li>\n</ul>\n<h2>12. The Mount Rushmore question: help people gain more positive perspectives on themselves</h2>\n<ul>\n<li>All those trivial, tiny, everyday encounters are opportunities for you to lead people into a better direction. </li>\n<li>Leadership is encouraging, motivating, and making opportunities for others. </li>\n<li>How did I make others’ lives different?</li>\n</ul>\n<h2>13. The race: be tough, lucky, selfless, and fair</h2>\n<ul>\n<li>Academics is not a matter of time.</li>\n<li>\n<p>Know what elements lead to success other than knowledge. And combine them well:</p>\n<ol>\n<li>Dealing with disappointments: successful people’s lives do not get stopped by disappointments. They get recovered fast.</li>\n<li>Luck: know that you are always more than the average luck worldwide.</li>\n<li>Leadership: make people act for their interests (what they are happy about).</li>\n<li>Fairness: be fair to the people working for you.</li>\n<li>Judgment: ochestrate the above four elements. Be wise. Be critical when judging a situation.</li>\n</ol>\n</li>\n</ul>\n<h2>14. The oath: begin to fix what has been broken</h2>\n<ul>\n<li>Ethics in entrepreneurship is crucial.</li>\n<li>Do not let people get disappointed by your business ethics.</li>\n</ul>\n<h2>15. Remember who you are: dream and hope and believe in yourself</h2>\n<ul>\n<li>You need to become a leader when you step out of the threshold today as well. Do not ever step back for what you think is right or wrong. Do not let anybody treat you bad. Remembmer who you are.</li>\n<li>You must remember the people who worked and sacrificed for you so that the ‘present You’ exists. As you go out, you are shouldered with heavy responsibility for that. Remember promises, opportunities, and hopes. </li>\n<li>If things are worth ‘doing’, they are also worth ‘doing well’.</li>\n<li>Belive in yourself. Live up to your promises, opportunities, and your hopes to change the world. </li>\n<li>Dream and let your passion surge.</li>\n</ul>","frontmatter":{"title":"100 Books Project (1): Reflection and reading notes on Remember Who You Are: Life Stories That Inspire the Heart and Mind","date":"March 09, 2019"}}},"pageContext":{"slug":"/2019-03-09--100BooksProject-(1):Remember-Who-You-Are:-Life-Stories-That-Inspire-the-Heart-and-Mind/","previous":{"fields":{"slug":"/2019-03-02--Youtube-lite:-looking-back/"},"frontmatter":{"title":"Youtube lite: looking back"}},"next":{"fields":{"slug":"/2019-03-13--Updating-python3-on-an-outdated-ubuntu/"},"frontmatter":{"title":"Updating python 3 on an outdated Ubuntu"}}}}