{"data":{"site":{"siteMetadata":{"title":"Joel's dev blog","author":"Joel Mun"}},"markdownRemark":{"id":"fc63354c-f31b-5dad-8997-a13814a77b8b","excerpt":"WEP It is short for Wired Equivalent Privacy (or Wireless Encryption Protocol) WEP has three settings: Off (no security), 64-bit (weak security), 128-bit (a bit…","html":"<h3>WEP</h3>\n<blockquote>\n<p>It is short for Wired Equivalent Privacy (or Wireless Encryption Protocol)</p>\n</blockquote>\n<blockquote>\n<p>WEP has three settings: Off (no security), 64-bit (weak security), 128-bit (a bit better security). WEP is not difficult to crack, and using it reduces performance slightly.</p>\n</blockquote>\n<blockquote>\n<p>WEP is used at the two lowest layers of the OSI model - the data link and physical layers; it therefore does not offer end-to-end security.</p>\n</blockquote>\n<blockquote>\n<p><strong>Weakness</strong>: WEP’s major weakness is its use of static encryption keys. When you set up a router with a WEP encryption key, that one key is used by every device on your network to encrypt every packet that’s transmitted. But the fact that packets are encrypted doesn’t prevent them from being intercepted, and due to some esoteric technical flaws it’s entirely possible for an eavesdropper to intercept enough WEP-encrypted packets to eventually deduce what the key is.</p>\n</blockquote>\n<h3>WPA</h3>\n<blockquote>\n<p>It is short for Short for Wi-Fi Protected Access.</p>\n</blockquote>\n<blockquote>\n<p>It was designed to overcome the vulnerabilities in WEP.</p>\n</blockquote>\n<blockquote>\n<p>WPA provides stronger encryption than WEP through use of either of two standard technologies: Temporal Key Integrity Protocol (TKIP) and Advanced Encryption Standard (AES). WPA also includes built-in authentication support that WEP does not offer.</p>\n</blockquote>\n<h3>WPA2</h3>\n<h3>WPA2</h3>\n<blockquote>\n</blockquote>\n<h3>Sources</h3>\n<p><a href=\"https://kb.netgear.com/1141/What-is-WEP-wireless-encryption\">Netgear</a>\n[</p>","frontmatter":{"title":"Wifi","date":"March 21, 2018"}}},"pageContext":{"slug":"/2018-03-21--Wifi/","previous":{"fields":{"slug":"/2018-03-21--Window-cmd-commands/"},"frontmatter":{"title":"Windows cmd commands"}},"next":{"fields":{"slug":"/2018-03-21--Using-git/"},"frontmatter":{"title":"Using git"}}}}