{"data":{"site":{"siteMetadata":{"title":"Joel's dev blog","author":"Joel Mun","siteUrl":"https://9oelm.github.io"}},"markdownRemark":{"id":"7d60e531-b4a0-5b42-a976-02bc56cfa94c","excerpt":"Cookies An HTTP cookie (web cookie, browser cookie) is a small piece of data that a server sends to the user’s web browser. The browser may store it and send it…","html":"<h3>Cookies</h3>\n<blockquote>\n<p>An HTTP cookie (web cookie, browser cookie) is a small piece of data that a server sends to the user’s web browser. The browser may store it and send it back with the next request to the same server.<br>\nWhen receiving an HTTP request, a server can send a Set-Cookie header with the response. The cookie is usually stored by the browser, and then the cookie is sent with requests made to the same server inside a Cookie HTTP header. </p>\n</blockquote>\n<blockquote>\n<p>There are two types of cookies:</p>\n</blockquote>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">* Session cookies: The cookie created above is a session cookie: it is deleted when the client shuts down, because it didn&#39;t specify an Expires or Max-Age directive. However, web browsers may use session restoring, which makes most session cookies permanent, as if the browser was never closed.\n* Permanent cookies: Instead of expiring when the client closes, permanent cookies expire at a specific date (Expires) or after a specific length of time (Max-Age).</code></pre></div>\n<h3>Sessions</h3>\n<blockquote>\n<p>Sessions are stored on the server, which means clients do not have access to the information you store about them - this is particularly important if you store shopping baskets or other information you do not want you visitors to be able to edit by hand by hacking their cookies. </p>\n</blockquote>\n<blockquote>\n<p>Session data, being stored on your server, does not need to be transmitted with each page; clients just need to send an ID and the data is loaded from the local file. Finally, sessions can be any size you want because they are held on your server, whereas many web browsers have a limit on how big cookies can be to stop rogue web sites chewing up gigabytes of data with meaningless cookie information.</p>\n</blockquote>\n<h3>+ from stackoverflow users</h3>\n<blockquote>\n<p>It is preferred to use sessions because the actual values are hidden from the client, and you control when the data expires and becomes invalid. If it was all based on cookies, a user (or hacker) could manipulate their cookie data and then play requests to your site.</p>\n</blockquote>\n<blockquote>\n<p><strong>Session</strong>:</p>\n</blockquote>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">* IDU is stored on server (i.e. server-side)\n* Safer (because of 1)\n* Expiration can not be set, session variables will be expired when users close the browser. (nowadays it is stored for 24 minutes as default in php)</code></pre></div>\n<blockquote>\n<p><strong>Cookies</strong>:</p>\n</blockquote>\n<div class=\"gatsby-highlight\" data-language=\"text\"><pre class=\"language-text\"><code class=\"language-text\">* IDU is stored on web-browser (i.e. client-side)\n* Not very safe, since hackers can reach and get your information (because of 1)\n* Expiration can be set (see setcookies() for more information)</code></pre></div>\n<h3>Sources</h3>\n<ul>\n<li><a href=\"http://www.hackingwithphp.com/10/1/0/cookies-vs-sessions\">hackingwithphp</a></li>\n<li><a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/Cookies\">Mozila</a></li>\n<li><a href=\"https://stackoverflow.com/questions/6253633/cookies-vs-sessions\">Stackoverflow</a></li>\n</ul>","frontmatter":{"title":"Difference between cookies and sessions","date":"December 31, 2017"}}},"pageContext":{"slug":"/2017-12-31--Difference-between-cookies-and-sessions/","previous":{"fields":{"slug":"/2017-10-06--Using-curl-to-get-external-ip-address-and-my-geolocation/"},"frontmatter":{"title":"Using curl to get external ip address and my geolocation"}},"next":{"fields":{"slug":"/2018-03-21--Window-cmd-commands/"},"frontmatter":{"title":"Windows cmd commands"}}}}