{"data":{"site":{"siteMetadata":{"title":"Joel's dev blog","author":"Joel Mun","siteUrl":"https://9oelm.github.io"}},"markdownRemark":{"id":"606bed39-405d-5b3b-b6ac-d515897aa733","excerpt":"Some job postings to see (2018 Jan)\\ Goldman Sachs Bachelor of Science in Computer Science, System/Computer Engineering, Cyber-Security, or Information Security…","html":"<h3>Some job postings to see (2018 Jan)\\</h3>\n<p><strong>Goldman Sachs</strong></p>\n<ul>\n<li>Bachelor of Science in Computer Science, System/Computer Engineering, Cyber-Security, or Information Security is preferred. </li>\n<li>Four (4) years of additional work experience may be substituted in lieu of a Bachelor’s Degree. </li>\n<li>Bachelors of Science/Arts in Forensic Computing, System/Computer Engineering, Data Science, Engineering, Operations Research, or Decision Science will be considered.</li>\n<li>Coursework or experience in computer science, computer security, computer networking, system design, system integration, software development, emerging technologies, open source frameworks, encryption schemes, and application testing/penetration testing/reviews preferred.</li>\n<li>Industry Certifications such as CISSP or GIAC Cyber Defense, Penetration Testing, or Incident Response and Forensics-related certifications</li>\n</ul>\n<p><strong>EY</strong></p>\n<ul>\n<li>Infrastructure Information systems security assessment, design, architecture, implementation, management and reporting</li>\n<li>Strong technical or security skills related to a broad range of operating systems, databases or security tools, e.g., UNIX, Linux, Windows 2000 and NT, firewalls and IDS systems</li>\n<li>Experience with programming languages such as Java, C, C++, C#, asp, and .NET</li>\n<li>Experience of security testing methods and techniques including network, operating and application system configuration review and internal/external penetration testing</li>\n<li>Experience of manual attack and penetration testing above and beyond the running of automated tools</li>\n<li>Experience in developing custom scripts or programs (used for port scanning and vulnerability identification)</li>\n<li>An understanding of web based application vulnerabilities and experience in application security review and testing</li>\n<li>An understanding of mobile application vulnerabilities and experience in mobile application security review and testing</li>\n<li>Familiarity with security standards reference such as OWASP, SANS, NIST</li>\n<li>Understanding of secure development practice and framework</li>\n</ul>\n<p><strong>Credit Suisse</strong></p>\n<ul>\n<li>Knowledge or experience of agile development (e.g. XP, SCRUM, Automated testing, Kanban…)</li>\n<li>Experience developing and testing using an Object Oriented language e.g. Java, Groovy, Scala, C#, Ruby</li>\n<li>Experience developing and testing using JavaScript (server and client side), AngularJS, React, and HTML5</li>\n<li>Strong client relationship skills with a strong customer service-oriented attitude</li>\n</ul>\n<p><strong>Verizon</strong></p>\n<ul>\n<li>Experience with mobile application penetration testing highly desired</li>\n<li>Certifications such as CEH, OSCP, CISSP</li>\n</ul>\n<p><strong>IBM</strong></p>\n<ul>\n<li>Preferred Tech And Prof Experience</li>\n<li>Familiarity with the following protocols: ARP, DHCP, DNS, DSN, FTP, HTTP, IMAP, ICMP, IDRP, IP, IRC, NFS, POP3, PAR, RLOGIN, SMB, SMTP, SSL, SSH, TCP, TELNET, UDP. Strong knowledge of Windows® Internals, Windows® Application Programming Interfaces (API), Portable Executable (PE) formats, Windows® Registry, and security models.</li>\n<li>Security+ and CEH</li>\n<li>OSCP, GPEN, GWAPT, LPT, GCIH</li>\n<li>Experience with dynamic source code analysis</li>\n<li>Extensive experience with Tenable Nessus</li>\n<li>Experience with Core Impact</li>\n<li>Experience with IBM Appscan</li>\n<li>5 years’ experience</li>\n<li>Bachelor’s Degree related to position</li>\n</ul>\n<p><strong>Salesforce</strong></p>\n<ul>\n<li>BS/MS degree, or relevant work experience</li>\n<li>Infrastructure and application level penetration testing experience</li>\n<li>Expert knowledge in computer and network security</li>\n<li>Extensive knowledge of the OWASP Top 10 and CWE Top 25</li>\n<li>Experience in exploiting web and web services security vulnerabilities including cross-site scripting, cross site request forgery, SQL injection, DoS attacks, XML/SOAP, API attacks, and more.</li>\n<li>Strong coding skills; Software development, Java, PHP, Perl, Python, Ruby, etc….</li>\n<li>BS Computer Science or equivalent knowledge and experience</li>\n<li>Offensive attack hacker mindset</li>\n<li>Experience with the latest and greatest penetration testing tools</li>\n<li>Desired Skills And Credentials</li>\n<li>Assembly/exploit developpment experience</li>\n<li>Bug bounty awards</li>\n<li>Experience in software development, Java, PHP, Perl, Python, Ruby, etc….</li>\n<li>Information security certifications, GPEN, OSCP, OSCE, OSWE, CEH, CISSP</li>\n<li>Ability to self motivate when given strategic goals.</li>\n</ul>\n<p><strong>Thales</strong></p>\n<ul>\n<li>University coursework in Electrical Engineering, Computer Sciences, or a related area of studies is preferred</li>\n<li>Advantage with professional certifications (e.g. CISA, CISSP)</li>\n<li>Fluent spoken English, Cantonese and Mandarin (preferred)</li>\n<li>Good knowledge of IT Security (e.g. ISO/IEC 27001, Enterprise Risk Assessment</li>\n<li>Energetic, dynamic, honest, driven with advanced business acumen</li>\n<li>Enterprise Security Framework, penetration testing, application security review)</li>\n<li>Excellent communications skills, good technical abilities, a curious nature, and a creative mind</li>\n<li>Experience scoping engagements and developing technical proposals</li>\n<li>Experience developing C, C++, PHP+, MySQL, Java</li>\n<li>Experience reverse engineering of malware, disk and memory forensics</li>\n</ul>\n<p><strong>Amazon</strong></p>\n<ul>\n<li>Experience with ICS/SCADA penetration testing and use of attack frameworks (e.g. BlackEnergy)</li>\n<li>At least 3 years of Information Security experience</li>\n<li>Experience with security frameworks such as NIST 800-53r4, NISTIR 7628</li>\n<li>MS in Computer Science or equivalent</li>\n<li>Knowledge of networking protocols (e.g., TCP/IP, UDP, IPSEC, HTTP, HTTPS, routing protocols)</li>\n<li>Knowledge of system security vulnerabilities and remediation techniques</li>\n</ul>","frontmatter":{"title":"What I should be preparing","date":"January 01, 2018"}}},"pageContext":{"slug":"/2018-01-01--what-i-should-be-preparing/","previous":{"fields":{"slug":"/2017-12-31--Difference-between-cookies-and-sessions/"},"frontmatter":{"title":"Difference between cookies and sessions"}},"next":{"fields":{"slug":"/2018-03-21--Wifi/"},"frontmatter":{"title":"Wifi"}}}}