{"data":{"site":{"siteMetadata":{"title":"Joel's dev blog","author":"Joel Mun","siteUrl":"https://9oelm.github.io"}},"markdownRemark":{"id":"15d0b35d-9ce4-54ab-a3fb-e73e4d666ee1","excerpt":"What is VPN and how does it work Virtual Private Network. Microsoft’s Explanation Virtual private networks (VPNs) are point-to-point connections across a…","html":"<h2>What is VPN and how does it work</h2>\n<p>Virtual Private Network.</p>\n<h3><a href=\"https://technet.microsoft.com/en-us/library/cc731954(v=ws.10).aspx\">Microsoft’s Explanation</a></h3>\n<blockquote>\n<p>Virtual private networks (VPNs) are point-to-point connections across a private or public network, such as the Internet. A VPN client uses special TCP/IP-based protocols, called tunneling protocols, to make a virtual call to a virtual port on a VPN server.</p>\n</blockquote>\n<blockquote>\n<p>In a typical VPN deployment, a client initiates a virtual point-to-point connection to a remote access server over the Internet. The remote access server answers the call, authenticates the caller, and transfers data between the VPN client and the organization’s private network.</p>\n</blockquote>\n<blockquote>\n<p>To emulate a point-to-point link, data is encapsulated, or wrapped, with a header. <strong>The header provides routing information</strong> that enables the data to traverse the shared or public network to reach its endpoint. To emulate a private link, <strong>the data being sent is encrypted for confidentiality.</strong> Packets that are intercepted on the shared or public network are <strong>indecipherable without the encryption keys.</strong> </p>\n</blockquote>\n<p><img src=\"https://i-technet.sec.s-msft.com/dynimg/IC195333.gif\" alt=\"VPN\"></p>\n<h3><a href=\"http://www.rawbytes.com/virtual-private-networks-in-depth-technical-details/\">Tunnel in VPN</a></h3>\n<blockquote>\n<p>We all know encapsulation in networking. Weather you consider the OSI model or the TCP/IP model, we all grew up learning about how we use encapsulation in every layer of the forwarding plane. </p>\n</blockquote>\n<blockquote>\n<p>So if we put <strong>an additional layer of encapsulation on a packet at say layer 3 or layer 2 on one end and then remove that layer at the other end, we form a tunnel between the two endpoints.</strong> So tunneling simply means the original packet being encapsulated in a new header(s) and then sent from one device in the internet to another, while the reverse happens at the other end.</p>\n</blockquote>\n<blockquote>\n<p>Tunneling is a not just used in VPN, but in many places in the networking world. We generally use tunneling when we want to send a packet that is different and not recognized by the intermediate route nodes but used at the end nodes. </p>\n</blockquote>\n<p><img src=\"https://i-technet.sec.s-msft.com/dynimg/IC195334.gif\" alt=\"Tunnel\"></p>\n<h3>Virtual network adapter</h3>\n<p>To implement a tunnel we need a Virtual Network Adapter. A virtual network adapter is a network adapter completely in the software. It simulates a network interface (rawbytes.com). </p>\n<h2>Types of VPN</h2>\n<h3>1. Remote access VPN</h3>\n<p><img src=\"https://tiptopsecurity.com/wp-content/uploads/2016/06/RemoteAccessVPN.png\" alt=\"Remote access VPN\"></p>\n<blockquote>\n<p>Remote access VPN connections enable users working at home or on the road to access a server on a private network using the infrastructure provided by a public network, such as the Internet.</p>\n</blockquote>\n<blockquote>\n<p>From the user’s perspective, the VPN is a point-to-point connection between the computer (the VPN client) and an organization’s server. The exact infrastructure of the shared or public network is irrelevant because it appears logically as if the data is sent over a dedicated private link\n(microsoft).</p>\n</blockquote>\n<h3>2. Site-to-site (peer-to-peer) VPN</h3>\n<p><img src=\"https://tiptopsecurity.com/wp-content/uploads/2016/06/SiteToSiteVPN.png\" alt=\"Site-to-site VPN\"></p>\n<blockquote>\n<p>Site-to-site VPN connections (also known as router-to-router VPN connections) enable organizations to have routed connections between separate offices or with other organizations over a public network while helping to maintain secure communications. <strong>A routed VPN connection across the Internet logically operates as a dedicated wide area network (WAN) link.</strong> When networks are connected over the Internet, a router forwards packets to another router across a VPN connection. To the routers, the VPN connection operates as a data-link layer link.\nA site-to-site VPN connection connects two portions of a private network. The VPN server provides a routed connection to the network to which the VPN server is attached. <strong>The calling router (the VPN client) authenticates itself to the answering router (the VPN server), and, for mutual authentication, the answering router authenticates itself to the calling router.</strong> In a site-to site VPN connection, the packets sent from either router across the VPN connection typically do not originate at the routers (microsoft).</p>\n</blockquote>\n<h3>3. Properties of VPN connections (microsoft)</h3>\n<p>VPN connections that use PPTP, L2TP/IPsec, and SSTP have the following properties:</p>\n<ul>\n<li>Encapsulation</li>\n<li>Authentication</li>\n<li>Data encryption</li>\n</ul>\n<h2>Am I completely anonymous under VPN?</h2>\n<h2>References</h2>\n<ul>\n<li><a href=\"http://www.rawbytes.com/virtual-private-networks-in-depth-technical-details/\">rawbytes.com</a></li>\n<li><a href=\"https://technet.microsoft.com/en-us/library/cc731954(v=ws.10).aspx\">Microsoft</a></li>\n<li><a href=\"https://tiptopsecurity.com/all-about-vpns/\">tiptopsecurity</a></li>\n<li><a href=\"https://www.expressvpn.com/what-is-vpn\">expressvpn</a></li>\n</ul>","frontmatter":{"title":"VPN","date":"October 06, 2017"}}},"pageContext":{"slug":"/2017-10-06--VPN/","previous":{"fields":{"slug":"/2017-10-05--Screenshotting-on-Kali/"},"frontmatter":{"title":"Screenshotting on Kali"}},"next":{"fields":{"slug":"/2017-10-06--Using-curl-to-get-external-ip-address-and-my-geolocation/"},"frontmatter":{"title":"Using curl to get external ip address and my geolocation"}}}}